{
  "</think>": 151668,
  "</tool_call>": 151658,
  "</tool_response>": 151666,
  "<think>": 151667,
  "<tool_call>": 151657,
  "<tool_response>": 151665,
  "<|box_end|>": 151649,
  "<|box_start|>": 151648,
  "<|endoftext|>": 151643,
  "<|file_sep|>": 151664,
  "<|fim_middle|>": 151660,
  "<|fim_pad|>": 151662,
  "<|fim_prefix|>": 151659,
  "<|fim_suffix|>": 151661,
  "<|im_end|>": 151645,
  "<|im_start|>": 151644,
  "<|image_pad|>": 151655,
  "<|object_ref_end|>": 151647,
  "<|object_ref_start|>": 151646,
  "<|quad_end|>": 151651,
  "<|quad_start|>": 151650,
  "<|query_10|>": 151934,
  "<|query_11|>": 151935,
  "<|query_12|>": 151936,
  "<|query_13|>": 151937,
  "<|query_14|>": 151938,
  "<|query_15|>": 151939,
  "<|query_16|>": 151940,
  "<|query_17|>": 151941,
  "<|query_18|>": 151942,
  "<|query_19|>": 151943,
  "<|query_1|>": 151925,
  "<|query_20|>": 151944,
  "<|query_21|>": 151945,
  "<|query_22|>": 151946,
  "<|query_23|>": 151947,
  "<|query_24|>": 151948,
  "<|query_25|>": 151949,
  "<|query_26|>": 151950,
  "<|query_27|>": 151951,
  "<|query_28|>": 151952,
  "<|query_29|>": 151953,
  "<|query_2|>": 151926,
  "<|query_30|>": 151954,
  "<|query_31|>": 151955,
  "<|query_32|>": 151956,
  "<|query_33|>": 151957,
  "<|query_34|>": 151958,
  "<|query_35|>": 151959,
  "<|query_36|>": 151960,
  "<|query_37|>": 151961,
  "<|query_38|>": 151962,
  "<|query_39|>": 151963,
  "<|query_3|>": 151927,
  "<|query_40|>": 151964,
  "<|query_41|>": 151965,
  "<|query_42|>": 151966,
  "<|query_43|>": 151967,
  "<|query_44|>": 151968,
  "<|query_45|>": 151969,
  "<|query_46|>": 151970,
  "<|query_47|>": 151971,
  "<|query_48|>": 151972,
  "<|query_49|>": 151973,
  "<|query_4|>": 151928,
  "<|query_50|>": 151974,
  "<|query_51|>": 151975,
  "<|query_52|>": 151976,
  "<|query_53|>": 151977,
  "<|query_54|>": 151978,
  "<|query_55|>": 151979,
  "<|query_56|>": 151980,
  "<|query_57|>": 151981,
  "<|query_58|>": 151982,
  "<|query_59|>": 151983,
  "<|query_5|>": 151929,
  "<|query_60|>": 151984,
  "<|query_61|>": 151985,
  "<|query_62|>": 151986,
  "<|query_63|>": 151987,
  "<|query_6|>": 151930,
  "<|query_7|>": 151931,
  "<|query_8|>": 151932,
  "<|query_9|>": 151933,
  "<|repo_name|>": 151663,
  "<|res_100|>": 151768,
  "<|res_101|>": 151769,
  "<|res_102|>": 151770,
  "<|res_103|>": 151771,
  "<|res_104|>": 151772,
  "<|res_105|>": 151773,
  "<|res_106|>": 151774,
  "<|res_107|>": 151775,
  "<|res_108|>": 151776,
  "<|res_109|>": 151777,
  "<|res_10|>": 151678,
  "<|res_110|>": 151778,
  "<|res_111|>": 151779,
  "<|res_112|>": 151780,
  "<|res_113|>": 151781,
  "<|res_114|>": 151782,
  "<|res_115|>": 151783,
  "<|res_116|>": 151784,
  "<|res_117|>": 151785,
  "<|res_118|>": 151786,
  "<|res_119|>": 151787,
  "<|res_11|>": 151679,
  "<|res_120|>": 151788,
  "<|res_121|>": 151789,
  "<|res_122|>": 151790,
  "<|res_123|>": 151791,
  "<|res_124|>": 151792,
  "<|res_125|>": 151793,
  "<|res_126|>": 151794,
  "<|res_127|>": 151795,
  "<|res_128|>": 151796,
  "<|res_129|>": 151797,
  "<|res_12|>": 151680,
  "<|res_130|>": 151798,
  "<|res_131|>": 151799,
  "<|res_132|>": 151800,
  "<|res_133|>": 151801,
  "<|res_134|>": 151802,
  "<|res_135|>": 151803,
  "<|res_136|>": 151804,
  "<|res_137|>": 151805,
  "<|res_138|>": 151806,
  "<|res_139|>": 151807,
  "<|res_13|>": 151681,
  "<|res_140|>": 151808,
  "<|res_141|>": 151809,
  "<|res_142|>": 151810,
  "<|res_143|>": 151811,
  "<|res_144|>": 151812,
  "<|res_145|>": 151813,
  "<|res_146|>": 151814,
  "<|res_147|>": 151815,
  "<|res_148|>": 151816,
  "<|res_149|>": 151817,
  "<|res_14|>": 151682,
  "<|res_150|>": 151818,
  "<|res_151|>": 151819,
  "<|res_152|>": 151820,
  "<|res_153|>": 151821,
  "<|res_154|>": 151822,
  "<|res_155|>": 151823,
  "<|res_156|>": 151824,
  "<|res_157|>": 151825,
  "<|res_158|>": 151826,
  "<|res_159|>": 151827,
  "<|res_15|>": 151683,
  "<|res_160|>": 151828,
  "<|res_161|>": 151829,
  "<|res_162|>": 151830,
  "<|res_163|>": 151831,
  "<|res_164|>": 151832,
  "<|res_165|>": 151833,
  "<|res_166|>": 151834,
  "<|res_167|>": 151835,
  "<|res_168|>": 151836,
  "<|res_169|>": 151837,
  "<|res_16|>": 151684,
  "<|res_170|>": 151838,
  "<|res_171|>": 151839,
  "<|res_172|>": 151840,
  "<|res_173|>": 151841,
  "<|res_174|>": 151842,
  "<|res_175|>": 151843,
  "<|res_176|>": 151844,
  "<|res_177|>": 151845,
  "<|res_178|>": 151846,
  "<|res_179|>": 151847,
  "<|res_17|>": 151685,
  "<|res_180|>": 151848,
  "<|res_181|>": 151849,
  "<|res_182|>": 151850,
  "<|res_183|>": 151851,
  "<|res_184|>": 151852,
  "<|res_185|>": 151853,
  "<|res_186|>": 151854,
  "<|res_187|>": 151855,
  "<|res_188|>": 151856,
  "<|res_189|>": 151857,
  "<|res_18|>": 151686,
  "<|res_190|>": 151858,
  "<|res_191|>": 151859,
  "<|res_192|>": 151860,
  "<|res_193|>": 151861,
  "<|res_194|>": 151862,
  "<|res_195|>": 151863,
  "<|res_196|>": 151864,
  "<|res_197|>": 151865,
  "<|res_198|>": 151866,
  "<|res_199|>": 151867,
  "<|res_19|>": 151687,
  "<|res_1|>": 151669,
  "<|res_200|>": 151868,
  "<|res_201|>": 151869,
  "<|res_202|>": 151870,
  "<|res_203|>": 151871,
  "<|res_204|>": 151872,
  "<|res_205|>": 151873,
  "<|res_206|>": 151874,
  "<|res_207|>": 151875,
  "<|res_208|>": 151876,
  "<|res_209|>": 151877,
  "<|res_20|>": 151688,
  "<|res_210|>": 151878,
  "<|res_211|>": 151879,
  "<|res_212|>": 151880,
  "<|res_213|>": 151881,
  "<|res_214|>": 151882,
  "<|res_215|>": 151883,
  "<|res_216|>": 151884,
  "<|res_217|>": 151885,
  "<|res_218|>": 151886,
  "<|res_219|>": 151887,
  "<|res_21|>": 151689,
  "<|res_220|>": 151888,
  "<|res_221|>": 151889,
  "<|res_222|>": 151890,
  "<|res_223|>": 151891,
  "<|res_224|>": 151892,
  "<|res_225|>": 151893,
  "<|res_226|>": 151894,
  "<|res_227|>": 151895,
  "<|res_228|>": 151896,
  "<|res_229|>": 151897,
  "<|res_22|>": 151690,
  "<|res_230|>": 151898,
  "<|res_231|>": 151899,
  "<|res_232|>": 151900,
  "<|res_233|>": 151901,
  "<|res_234|>": 151902,
  "<|res_235|>": 151903,
  "<|res_236|>": 151904,
  "<|res_237|>": 151905,
  "<|res_238|>": 151906,
  "<|res_239|>": 151907,
  "<|res_23|>": 151691,
  "<|res_240|>": 151908,
  "<|res_241|>": 151909,
  "<|res_242|>": 151910,
  "<|res_243|>": 151911,
  "<|res_244|>": 151912,
  "<|res_245|>": 151913,
  "<|res_246|>": 151914,
  "<|res_247|>": 151915,
  "<|res_248|>": 151916,
  "<|res_249|>": 151917,
  "<|res_24|>": 151692,
  "<|res_250|>": 151918,
  "<|res_251|>": 151919,
  "<|res_252|>": 151920,
  "<|res_253|>": 151921,
  "<|res_254|>": 151922,
  "<|res_255|>": 151923,
  "<|res_256|>": 151924,
  "<|res_25|>": 151693,
  "<|res_26|>": 151694,
  "<|res_27|>": 151695,
  "<|res_28|>": 151696,
  "<|res_29|>": 151697,
  "<|res_2|>": 151670,
  "<|res_30|>": 151698,
  "<|res_31|>": 151699,
  "<|res_32|>": 151700,
  "<|res_33|>": 151701,
  "<|res_34|>": 151702,
  "<|res_35|>": 151703,
  "<|res_36|>": 151704,
  "<|res_37|>": 151705,
  "<|res_38|>": 151706,
  "<|res_39|>": 151707,
  "<|res_3|>": 151671,
  "<|res_40|>": 151708,
  "<|res_41|>": 151709,
  "<|res_42|>": 151710,
  "<|res_43|>": 151711,
  "<|res_44|>": 151712,
  "<|res_45|>": 151713,
  "<|res_46|>": 151714,
  "<|res_47|>": 151715,
  "<|res_48|>": 151716,
  "<|res_49|>": 151717,
  "<|res_4|>": 151672,
  "<|res_50|>": 151718,
  "<|res_51|>": 151719,
  "<|res_52|>": 151720,
  "<|res_53|>": 151721,
  "<|res_54|>": 151722,
  "<|res_55|>": 151723,
  "<|res_56|>": 151724,
  "<|res_57|>": 151725,
  "<|res_58|>": 151726,
  "<|res_59|>": 151727,
  "<|res_5|>": 151673,
  "<|res_60|>": 151728,
  "<|res_61|>": 151729,
  "<|res_62|>": 151730,
  "<|res_63|>": 151731,
  "<|res_64|>": 151732,
  "<|res_65|>": 151733,
  "<|res_66|>": 151734,
  "<|res_67|>": 151735,
  "<|res_68|>": 151736,
  "<|res_69|>": 151737,
  "<|res_6|>": 151674,
  "<|res_70|>": 151738,
  "<|res_71|>": 151739,
  "<|res_72|>": 151740,
  "<|res_73|>": 151741,
  "<|res_74|>": 151742,
  "<|res_75|>": 151743,
  "<|res_76|>": 151744,
  "<|res_77|>": 151745,
  "<|res_78|>": 151746,
  "<|res_79|>": 151747,
  "<|res_7|>": 151675,
  "<|res_80|>": 151748,
  "<|res_81|>": 151749,
  "<|res_82|>": 151750,
  "<|res_83|>": 151751,
  "<|res_84|>": 151752,
  "<|res_85|>": 151753,
  "<|res_86|>": 151754,
  "<|res_87|>": 151755,
  "<|res_88|>": 151756,
  "<|res_89|>": 151757,
  "<|res_8|>": 151676,
  "<|res_90|>": 151758,
  "<|res_91|>": 151759,
  "<|res_92|>": 151760,
  "<|res_93|>": 151761,
  "<|res_94|>": 151762,
  "<|res_95|>": 151763,
  "<|res_96|>": 151764,
  "<|res_97|>": 151765,
  "<|res_98|>": 151766,
  "<|res_99|>": 151767,
  "<|res_9|>": 151677,
  "<|video_pad|>": 151656,
  "<|vision_end|>": 151653,
  "<|vision_pad|>": 151654,
  "<|vision_start|>": 151652
}
