{
  "additional_special_tokens": [
    "<|query_1|>",
    "<|query_2|>",
    "<|query_3|>",
    "<|query_4|>",
    "<|query_5|>",
    "<|query_6|>",
    "<|query_7|>",
    "<|query_8|>",
    "<|query_9|>",
    "<|query_10|>",
    "<|query_11|>",
    "<|query_12|>",
    "<|query_13|>",
    "<|query_14|>",
    "<|query_15|>",
    "<|query_16|>",
    "<|query_17|>",
    "<|query_18|>",
    "<|query_19|>",
    "<|query_20|>",
    "<|query_21|>",
    "<|query_22|>",
    "<|query_23|>",
    "<|query_24|>",
    "<|query_25|>",
    "<|query_26|>",
    "<|query_27|>",
    "<|query_28|>",
    "<|query_29|>",
    "<|query_30|>",
    "<|query_31|>",
    "<|query_32|>",
    "<|query_33|>",
    "<|query_34|>",
    "<|query_35|>",
    "<|query_36|>",
    "<|query_37|>",
    "<|query_38|>",
    "<|query_39|>",
    "<|query_40|>",
    "<|query_41|>",
    "<|query_42|>",
    "<|query_43|>",
    "<|query_44|>",
    "<|query_45|>",
    "<|query_46|>",
    "<|query_47|>",
    "<|query_48|>",
    "<|query_49|>",
    "<|query_50|>",
    "<|query_51|>",
    "<|query_52|>",
    "<|query_53|>",
    "<|query_54|>",
    "<|query_55|>",
    "<|query_56|>",
    "<|query_57|>",
    "<|query_58|>",
    "<|query_59|>",
    "<|query_60|>",
    "<|query_61|>",
    "<|query_62|>",
    "<|query_63|>"
  ],
  "eos_token": {
    "content": "<|im_end|>",
    "lstrip": false,
    "normalized": false,
    "rstrip": false,
    "single_word": false
  },
  "pad_token": {
    "content": "<|endoftext|>",
    "lstrip": false,
    "normalized": false,
    "rstrip": false,
    "single_word": false
  }
}
